generating-free-polyominos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-05 Fri 23:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Generating free polyominos for exact covering</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Josh Berry" />
<link rel="stylesheet" type="text/css" href="org-overrides.css" />
</head>
<body>
<div id="content">
<h1 class="title">Generating free polyominos for exact covering</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4635ca9">Generating "free" polyominos.</a></li>
<li><a href="#orgc36583b">From last time</a></li>
<li><a href="#orgac0bf69">Now, flipping.</a></li>
<li><a href="#orgeb638d1">Now, continuing basically from before.</a></li>
<li><a href="#org5cba883">With one last change</a></li>
<li><a href="#orga497ff0">And finally, the same dance as last time</a></li>
<li><a href="#org297c3f1">Conclusion</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4635ca9" class="outline-2">
<h2 id="org4635ca9">Generating "free" polyominos.</h2>
<div class="outline-text-2" id="text-org4635ca9">
<p>
My <a href="generating-polyominos.html">last attempt</a> at this resulted in a program that would give me all
of the files to pipe into DLX for "one-sided" versions of polyominos.
(I blame a tetris mindset for me thinking that was the natural place
to start.)
</p>

<p>
This time, we'll do the same thing, but not for the "one-sided
variants."  I'll go quicker through some of the earlier parts, since
they aren't changing.
</p>
</div>
</div>

<div id="outline-container-orgc36583b" class="outline-2">
<h2 id="orgc36583b">From last time</h2>
<div class="outline-text-2" id="text-orgc36583b">
<p>
We'll start by simply pulling in all of the functions from last time.
Not going to look at output from them, since I did enough of that in
the <a href="generating-polyominos.html">previous page</a>.
</p>

<div class="org-src-container">
<pre class="src src-:session">(defstruct coordinate (x 0 :read-only t) (y 0 :read-only t))

(defun left (coordinate)
  (with-slots (x y) coordinate
    (make-coordinate :x x :y (- y 1))))
(defun right (coordinate)
  (with-slots (x y) coordinate
    (make-coordinate :x x :y (+ y 1))))
(defun up (coordinate)
  (with-slots (x y) coordinate
    (make-coordinate :x (- x 1) :y y)))
(defun down (coordinate)
  (with-slots (x y) coordinate
    (make-coordinate :x (+ x 1) :y y)))

(defstruct polyomino (active-coordinates nil :read-only t))

(defun polyomino-degree (polyomino)
  (length (slot-value polyomino 'active-coordinates)))

(defun polyomino-add-coordinate (polyomino coordinate)
  (make-polyomino :active-coordinates (adjoin coordinate (slot-value polyomino 'active-coordinates) :test #'equalp)))

(defun polyomino-has-coordinate (polyomino coordinate)
  (member coordinate (slot-value polyomino 'active-coordinates) :test #'equalp))

(defun polyomino-to-string (polyomino)
  (let ((width (polyomino-degree polyomino))
        (height (polyomino-degree polyomino)))
    (format nil "犴鸹狺"
            (loop for i from 0 below height
               collect (loop for j from 0 below width
                          collect (if (polyomino-has-coordinate polyomino (make-coordinate :x i :y j))
                                      "X"
                                      "-"))))))

(defun polyomino-normalize (polyomino)
  (loop for coordinate in (slot-value polyomino 'active-coordinates)
     minimizing (slot-value coordinate 'x) into min-x
     minimizing (slot-value coordinate 'y) into min-y
     finally (return (make-polyomino :active-coordinates
                                     (sort (loop for coordinate in (slot-value polyomino 'active-coordinates)
                                              collect (with-slots (x y) coordinate
                                                        (make-coordinate :x (- x min-x)
                                                                         :y (- y min-y))))
                                           (lambda (a b)
                                             (with-slots ((ax x) (ay y)) a
                                               (with-slots ((bx x) (by y)) b
                                                 (&lt; (+ (* ax (polyomino-degree polyomino))
                                                       ay)
                                                    (+ (* bx (polyomino-degree polyomino))
                                                       by))))))))))

(defun polyomino-rotate (polyomino)
  (let ((d (- (polyomino-degree polyomino) 1)))
    (polyomino-normalize
     (make-polyomino :active-coordinates
                     (with-slots (active-coordinates) polyomino
                       (loop for coordinate in active-coordinates
                          collect (with-slots (x y) coordinate
                                    (make-coordinate :x y :y (- d x)))))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgac0bf69" class="outline-2">
<h2 id="orgac0bf69">Now, flipping.</h2>
<div class="outline-text-2" id="text-orgac0bf69">
<p>
With all of that, I simply need a way to flip polyominos so that I can
get to the "other side" of them.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">polyomino-flip</span> (polyomino)
  (polyomino-normalize
   (make-polyomino <span style="color: #DCDCCC; font-weight: bold;">:active-coordinates</span>
                   (<span style="color: #F0DFAF; font-weight: bold;">loop</span> for coordinate in (slot-value polyomino 'active-coordinates)
                      collect (<span style="color: #F0DFAF; font-weight: bold;">with-slots</span> (x y) coordinate
                                (make-coordinate <span style="color: #DCDCCC; font-weight: bold;">:x</span> y <span style="color: #DCDCCC; font-weight: bold;">:y</span> x))))))
</pre>
</div>

<p>
And, just to make sure it turns a "s" piece into an "z" piece.
</p>

<div class="org-src-container">
<pre class="src src-:session">(let* ((a (make-coordinate))
       (b (up a))
       (c (left b))
       (d (up c))
       (p (make-polyomino :active-coordinates (list a b c d))))
  (format nil "狺播"
          (list
           (polyomino-to-string (polyomino-normalize p))
           (polyomino-to-string (polyomino-flip p)))))

</pre>
</div>

<pre class="example" id="org625fc2d">
X---
XX--
-X--
----

XX--
-XX-
----
----

</pre>
</div>
</div>

<div id="outline-container-orgeb638d1" class="outline-2">
<h2 id="orgeb638d1">Now, continuing basically from before.</h2>
<div class="outline-text-2" id="text-orgeb638d1">
<div class="org-src-container">
<pre class="src src-:session">(defun polyomino-grow-list (seeds)
  (let ((grown-values nil))
    (dolist (polyomino seeds)
      (let ((polyomino-coordinates (slot-value polyomino 'active-coordinates))
            (candidates nil))
        (dolist (c polyomino-coordinates)
          (progn
            (unless (member (up c) polyomino-coordinates :test #'equalp)
              (setf candidates (adjoin (up c) candidates :test #'equalp)))
            (unless (member (right c) polyomino-coordinates :test #'equalp)
              (setf candidates (adjoin (right c) candidates :test #'equalp)))
            (unless (member (down c) polyomino-coordinates :test #'equalp)
              (setf candidates (adjoin (down c) candidates :test #'equalp)))
            (unless (member (left c) polyomino-coordinates :test #'equalp)
              (setf candidates (adjoin (left c) candidates :test #'equalp)))))
        (dolist (c candidates)
          (let ((p (polyomino-normalize (polyomino-add-coordinate polyomino c))))
            (unless (or
                     (member p grown-values :test #'equalp)
                     (member (polyomino-rotate p) grown-values :test #'equalp)
                     (member (polyomino-flip p) grown-values :test #'equalp)
                     (member (polyomino-flip (polyomino-rotate p)) grown-values :test #'equalp)
                     (member (polyomino-rotate (polyomino-rotate p)) grown-values :test #'equalp)
                     (member (polyomino-flip (polyomino-rotate (polyomino-rotate p))) grown-values :test #'equalp)
                     (member (polyomino-rotate (polyomino-rotate (polyomino-rotate p))) grown-values :test #'equalp)
                     (member (polyomino-flip (polyomino-rotate (polyomino-rotate (polyomino-rotate p)))) grown-values :test #'equalp))
              (setf grown-values (cons p grown-values)))))))
    grown-values))
</pre>
</div>

<p>
So, was that all it took?  This time comparing to the "Total" count on the
<a href="https://en.wikipedia.org/wiki/Polyomino">Polyomino</a> wikipedia page.
</p>

<div class="org-src-container">
<pre class="src src-:session">(let* ((a (list (make-polyomino :active-coordinates (list (make-coordinate)))))
       (b (polyomino-grow-list a))
       (c (polyomino-grow-list b))
       (d (polyomino-grow-list c))
       (e (polyomino-grow-list d))
       (f (polyomino-grow-list e))
       (g (polyomino-grow-list f))
       (h (polyomino-grow-list g))
       (i (polyomino-grow-list h)))
  (mapcar #'length (list a b c d e f g h i)))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">5</td>
<td class="org-right">12</td>
<td class="org-right">35</td>
<td class="org-right">108</td>
<td class="org-right">369</td>
<td class="org-right">1285</td>
</tr>
</tbody>
</table>


<p>
Yes, we match again.  Yay!
</p>
</div>
</div>

<div id="outline-container-org5cba883" class="outline-2">
<h2 id="org5cba883">With one last change</h2>
<div class="outline-text-2" id="text-org5cba883">
<p>
Before, when I generated the placements, I iterated all unique
rotations.  Now, I need to iterate the unique rotations and flips.
</p>

<div class="org-src-container">
<pre class="src src-:session">(defun polyomino-unique-placements (p)
  (let* ((a (polyomino-rotate p))
         (b (polyomino-rotate a))
         (c (polyomino-rotate b))
         (d (polyomino-flip p))
         (e (polyomino-flip a))
         (f (polyomino-flip b))
         (g (polyomino-flip c))
         (l (list (polyomino-normalize p)))
         (l (adjoin a l :test #'equalp))
         (l (adjoin b l :test #'equalp))
         (l (adjoin c l :test #'equalp))
         (l (adjoin d l :test #'equalp))
         (l (adjoin e l :test #'equalp))
         (l (adjoin f l :test #'equalp))
         (l (adjoin g l :test #'equalp)))
    l))
</pre>
</div>

<p>
And, just to see how this treats an "s" piece:
</p>

<div class="org-src-container">
<pre class="src src-:session">(let* ((a (make-coordinate))
       (b (up a))
       (c (left b))
       (d (up c))
       (p (make-polyomino :active-coordinates (list a b c d))))
  (format nil "狺播"
          (mapcar #'polyomino-to-string (polyomino-unique-placements p))))
</pre>
</div>

<pre class="example" id="org5de5586">
-X--
XX--
X---
----

XX--
-XX-
----
----

-XX-
XX--
----
----

X---
XX--
-X--
----

</pre>
</div>
</div>


<div id="outline-container-orga497ff0" class="outline-2">
<h2 id="orga497ff0">And finally, the same dance as last time</h2>
<div class="outline-text-2" id="text-orga497ff0">
<p>
Nothing changes in generating the DLX inputs.  So, just dumping them
here again.
</p>

<div class="org-src-container">
<pre class="src src-:session">(defun polyomino-dlx-headers (board-size)
  (format nil "隐崦狺" (loop for i from 0 below board-size
     append (loop for j from 0 below board-size
                 collect (list i j)))))

(defun polyomino-dlx-generate-row (p board-size)
  (format nil "隐崦}%}"
          (loop for c in (slot-value p 'active-coordinates)
             maximizing (slot-value c 'x) into max-x
             maximizing (slot-value c 'y) into max-y
             finally (return (loop for i from 0 below (- board-size max-x)
                                append (loop for j from 0 below (- board-size max-y)
                                          collect (loop for c in (slot-value p 'active-coordinates)
                                                     collect (with-slots (x y) c
                                                               (list (+ x i) (+ y j))))))))))
(defun polyomino-dlx-generate (fileprefix degree board-size)
  (let ((polyominos (list (make-polyomino :active-coordinates (list (make-coordinate :x 0 :y 0))))))
    (dotimes (i (- degree 1))
      (setf polyominos (polyomino-grow-list polyominos)))

    (dotimes (i (length polyominos))
      (with-open-file (stream (format nil "a-a-a.dlx" fileprefix degree i)
                              :direction :output
                              :if-exists :supersede
                              :if-does-not-exist :create)
        (format stream "a&amp;" (polyomino-dlx-headers board-size))
        (dolist (rotation (polyomino-unique-placements (elt polyominos i)))
          (format stream "a&amp;" (polyomino-dlx-generate-row rotation board-size)))))))

(polyomino-dlx-generate "testing" 8 16)

</pre>
</div>
</div>
</div>

<div id="outline-container-org297c3f1" class="outline-2">
<h2 id="org297c3f1">Conclusion</h2>
<div class="outline-text-2" id="text-org297c3f1">
<p>
Not motivated enough to really dive into this.  Piping the above
programs into the dlx algorithm from Knuth's <a href="https://www-cs-faculty.stanford.edu/knuth/programs.html">homepage</a> takes a long
time.  About 4000 minutes, all told.  On a whim, I retried the
previous try's effort on the same program compiled with optimizations.
Result went from a minute down to 19 seconds.
</p>

<p>
Assuming the same benefit in time, I'm still looking at about a day's
worth of runtime.<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> I think I see how I could reduce the symmetric
solutions.  That drops me by a factor 4 (8?).  Still has me in the
hours for runtime, at best.
</p>

<p>
Granted, this <i>could</i> be a factor of the speed of my laptop.  Pushing
a decade in age, sure, but I don't think anything has really happened
recently to help in speed.  I was only running on 4 threads total for
all of the run, with a single thread dominating the runtime.<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>
</p>

<p>
At any rate I had fun.  Modifying the common lisp program was as easy
as to be expected.  Looking forward to more programs in that language.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Since it really just meant leaving my home computer on while I
was at work, I ran the optimized compilation against the larger set.
Brought it down to 1200 minutes, as predicted.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
Specifically, I ran
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #F0DFAF; font-weight: bold;">time</span> $(<span style="color: #CC9393;">find . -name '*.dlx' | grep "dlx" | xargs -P4 -n1 -I file sh -c './dlx &lt; "file"'</span>)
</pre>
</div>

<p class="footpara">
So, yes, I got some use of my multiple cores.  But only while there
were subproblems I could fan out.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Josh Berry</p>
<p class="date">Created: 2021-02-05 Fri 23:50</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
